carseven/PSOC-Cleaning-Robot/RobotCode/codegentemp/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.2
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Pin_Rojo.h"
#include "Pin_Rojo_aliases.h"
#include "Pin_Verde.h"
#include "Pin_Verde_aliases.h"
#include "Pin_Azul.h"
#include "Pin_Azul_aliases.h"
#include "Pin_Zumbador.h"
#include "Pin_Zumbador_aliases.h"
#include "PWM_1.h"
#include "PWM_2.h"
#include "Clock.h"
#include "PWM_A.h"
#include "PWM_A_aliases.h"
#include "PWM_B.h"
#include "PWM_B_aliases.h"
#include "Pin_MotorA_A.h"
#include "Pin_MotorA_A_aliases.h"
#include "Pin_MotorA_R.h"
#include "Pin_MotorA_R_aliases.h"
#include "Pin_MotorB_A.h"
#include "Pin_MotorB_A_aliases.h"
#include "Pin_MotorB_R.h"
#include "Pin_MotorB_R_aliases.h"
#include "Trigger.h"
#include "Trigger_aliases.h"
#include "PWM_3.h"
#include "Clock_1.h"
#include "Counter.h"
#include "Clock_2.h"
#include "Counter_Int.h"
#include "Echo.h"
#include "Echo_aliases.h"
#include "Pin_IR.h"
#include "Pin_IR_aliases.h"
#include "ADC.h"
#include "ADC_IRQ.h"
#include "ADC_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

